<!DOCTYPE html>

<html lang="en" xmlns="http://www.w3.org/1999/xhtml">
<head>
    <meta charset="utf-8" />

    <title>离散数学网</title>
    <!--现在的问题看来是引入不了css文件-->
    <!--现在的问题看来是引入不了css文件-->
    <!--现在的问题看来是引入不了css文件-->
    <!--现在的问题看来是引入不了css文件-->
    <!--现在的问题看来是引入不了css文件-->
    <!--现在的问题看来是引入不了css文件-->
    <link rel="stylesheet" type="text/css" href="/sx/css/kcjj.css" />

</head>
<!--  {dede:include filename='head.htm'/}-->
<?php
include('head.php');
?>
<!--首页主体-->
<div class="body0">
    <div class="oneleft" >
        <ul>
            <li>

                <a href="/sx">首页</a>
                <a href="kcjj.php">课程简介</a>
                <a href="zjjs.php">主讲教师</a>
                <a href="kckj.php">课程课件</a>
                <a href="kcnd.php">课程难点</a>
                <a href="zxjl.php">在线交流</a>
                <!--
                 <a href="/utf/">首页</a>
                {dede:channel type='top' }
                <a href='[field:typelink/]' target="_top">[field:typename/]</a>
                 {/dede:channel}
                -->


                <div style="clear:both;"></div>
            </li>
        </ul>
    </div>
    <div class="oneright"	 	>
        <div		class="top">
            <a href="/utf">首页</a>>课程简介
        </div>


<!--
        <div class="bottom">

            离散数学(Discrete mathematics)是研究离散量的结构及其相互关系的数学学科，是现代数学的一个重要分支。离散的含义是指    <div>
                    <img src="/sx/css/xiaohui.png" alt="">
        不同的连接在一起的元素，主要是研究基于离散量的结构和相互间的关系，其对象一般是有限个或可数个元素。离散数学在各学科领域，特别在计算机科学与技术领域有着广泛的应用，同时离散数学也是计算机专业的许多专业课程，如程序设计语言、数据结构、操作系统、编译技术、人工智能、数据库、算法设计与分析、理论计算机科学基础等必不可少的先行课程。通过离散数学的学习，不但可以掌握处理离散结构的描述工具和方法，为后续课程的学习创造条件，而且可以提高抽象思维和严格的逻辑推理能力，为将来参与创新性的研究和开发工作打下坚实的基础。
            </div>

-->
            <div class="bottom">

                          离散数学(Discrete mathematics)是研究离散量的结构及其相互关系的数学学科，是现代数学的一个重要分支。离散的含义是指
                    不同的连接在一起的元素，主要是研究基于离散量的结构和相互间的关系，其对象一般是有限个或可数个元素。离散数学在各学
                    科领域，特别在计算机科学与技术领域有着广泛的应用，同时离散数学也是计算机专业的许多专业课程，如程序设计语言、数据
                    结构、操作系统、编译技术、人工智能、数据库、算法设计与分析、理论计算机科学基础等必不可少的先行课程。通过离散数学
                    的学习，不但可以掌握处理离散结构的描述工具和方法，为后续课程的学习创造条件，而且可以提高抽象思维和严格的逻辑推理
                    能力，为将来参与创新性的研究和开发工作打下坚实的基础。
                    随着信息时代的到来，工业革命时代以微积分为代表的连续数学占主流的地位已经发生了变化，离散数学的重要性逐渐被人们
                    认识。离散数学课程所传授的思想和方法，广泛地体现在计算机科学技术及相关专业的诸领域，从科学计算到信息处理，从理论
                    计算机科学到计算机应用技术，从计算机软件到计算机硬件，从人工智能到认知系统，无不与离散数学密切相关。由于数字电子
                    计算机是一个离散结构，它只能处理离散的或离散化了的数量关系， 因此，无论计算机科学本身，还是与计算机科学及其应用密
                    切相关的现代科学研究领域，都面临着如何对离散结构建立相应的数学模型；又如何将已用连续数量关系建立起来的数学模型离
                    散化，从而可由计算机加以处理。[1]离散数学是传统的逻辑学，集合论（包括函数），数论基础，算法设计，组合分析，离散概率，关
                    系理论，图论与树，抽象代数（包括代数系统，群、环、域等），布尔代数，计算模型（语言与自动机）等汇集起来的
                    一门综合学科。离散数学的应用遍及现代科学技术的诸多领域。离散数学也可以说是计算机科学的基础核心学科，在离散数学中的有一
                    个著名的典型例子-四色定理又称四色猜想，这是世界近代三大数学难题之一，它是在1852年，由英国的一名绘图员弗南西斯·格思里提
                    出的，他在进行地图着色时，发现了一个现象，“每幅地图都可以仅用四种颜色着色，并且共同边界的国家都可以被着上不同的颜色”。那
                    么这能否从数学上进行证明呢？100多年后的1976年，肯尼斯·阿佩尔（Kenneth Appel）和沃尔夫冈·哈肯（Wolfgang Haken）使用计算机
                    辅助计算，用了1200个小时和100亿次的判断，终于证明了四色定理，轰动世界，这就是离散数学与计算机科学相互协作的结果。
                    离散数学可以看成是构筑在数学和计算机科学之间的桥梁，因为离散数学既离不开集合论、图论等数学知识，又和计算机科学中的数据库
                    理论、数据结构等相关，它可以引导人们进入计算机科学的思维领域，促进了计算机科学的发展。

            </div>
        </dd>
        <br  />
        <br  />
        <br  />

    </div>
</div>
<!--
	 <?php
//	echo $_SERVER['PHP_SELF']."<br>";
$a=$_SERVER['PHP_SELF'];
switch($a)
{
    case '/sx/includefiles/zjjs.php#':
        echo '>主讲教师'."<br >";
        break;
    case '/sx/includefiles/kcjj.php':
        echo '>课程简介'."<br >";
        break;
    case '/sx/includefiles/kcfj.php':
        echo '>课程附件'."<br >";
        break;
    case '/sx/includefiles/kcnd.php':
        echo '>课程难点'."<br >";
        break;
    case '/sx/includefiles/zxjl.php':
        echo '>在线交流'."<br >";
        break;
    default:
        echo '首页';
}
?>
			-->
<?php
include('footer.php');

?>


